[{
  "_id": {
    "$oid": "64a164ae4462c140de43150b"
  },
  "email": "user1@example.com",
  "created_at": "2023-06-03",
  "content": "June 3, 2023\n\nDear Diary,\n\nI’m so upset!! I don’t even know where to begin!\n\nTo start off, I think I completely failed my geometry quiz, which I know I should’ve studied more for...my dad’s not gonna be happy about that. :( Then, we had a pop quiz in history on the reading homework from last night, and I completely forgot most of what I read, which made me even more upset because I actually did the reading! But what really made me mad was the note that Sarah slipped into my locker during passing period. She said she was sad that I’ve been hanging out with Jane more lately and thinks that I don’t want to be her friend anymore. I can’t believe she thinks that, especially after talking with her on the phone for hours and hours last month while she was going through her breakup with Nick! Just because I’ve been hanging out with Jane a little more than usual doesn’t mean I’m not her friend anymore. She completely blew me off at lunch, and when I told Jane, she thought that Sarah was being a 'drama queen'.\n\nThis is just what I need! My parents are getting on my case about doing more extracurricular activities, I have a huge paper due for AP English soon, and I can’t understand a thing in advanced Spanish! The last thing I need is for my best friend to think I hate her and barely text me back anymore.\n\nUggh! I can’t concentrate on anything right now because of it. I hope she gets over it!!!\n\nLove,\n\nKate",
  "emotion": "anger",
  "emotion_distribution": {
    "sadness": 4.85,
    "joy": 0.19,
    "love": 0.04,
    "anger": 94.72,
    "fear": 0.17,
    "surprise": 0.03
  }
},
{
  "_id": {
    "$oid": "64a165170ebaced2b0032d56"
  },
  "email": "user1@example.com",
  "created_at": "2023-06-04",
  "content": "June 4, 2023\n\nDear Diary,\n\nToday was a little better. I texted Sarah last night asking if she wanted to have lunch with me today, just the two of us, and she said sure. I told her that just because I’m hanging out with Jane, it doesn’t change anything about our friendship. After all, we’ve been friends since first grade! She said that she knows that, but she just felt like the third wheel because she doesn’t think that Jane likes her and because Jane and I have a lot of classes together. I told her not to worry about what Jane thought and that I’d talk to her about it. Sarah felt a lot better, and after we both cried a little, we spent the rest of lunch catching up on the latest gossip, which I missed!  \n\nDuring English, I talked to Jane about what Sarah said. She said that it’s not that she doesn’t like Sarah; she just thinks that she gets too worked up about things sometime, like her breakup with Nick. I explained why Sarah was so upset about it and how Nick had cheated on her, which Jane didn’t know, and she felt bad for saying mean things about Sarah. I think Jane’s really cool, but I wish she wouldn’t assume things about people. I’m worried she was saying mean things about Sarah to our other friends when she didn’t know the truth. She sometimes likes to spread rumors even when she doesn’t know if they’re true.\n\nI thought it would be fun for the three of us to get some coffee after school and try to make everything better. I’m not sure how well that worked, because even though Jane was trying really hard to be nice to Sarah, I could tell that Sarah was being really fake with Jane. When I texted Sarah later, she said everything was fine, but I know her well enough to know that’s not completely true.\n\n::Sigh:: Oh well. I’m not her mom, and I can’t force her to feel anything. It just frustrates me because I don’t want things to change between us...\n\nWe’ll see what happens. I have to get some math homework done now!\n\nNight!\n\nKate",
  "emotion": "joy",
  "emotion_distribution": {
    "sadness": 0.89,
    "joy": 98.69,
    "love": 0.09,
    "anger": 0.23,
    "fear": 0.07,
    "surprise": 0.03
  }
},
{
  "_id": {
    "$oid": "64a1659d24c3f80cb2a49a75"
  },
  "email": "user1@example.com",
  "created_at": "2023-06-06",
  "content": "June 6, 2023\n\nDear Diary,\n\nSorry I didn’t get to write last night! It was such a busy day, and I was too tired to write anything...\n\nI was right about Sarah not being okay. Yesterday, she barely spoke to me, and anything she did say was a “yes” or “no” answer.  I tried so hard to get her to cheer up, but of course she just kept saying, “I’m fine, I’m fine.” Uggh! I wish she would just be honest with me! I’m always honest with her! It’s not fair!\n\nJane also seemed mad all day because she could tell that Sarah was being fake nice to her. I hate being in the middle of all of this. What am I supposed to do? Sarah’s been my friend since forever, and Jane is my new friend, and I don’t want to hurt anyone’s feelings! But I think that Jane is right about Sarah. I think Sarah sometimes gets too dramatic about things. She’s being kind of a brat about all of this, but I don’t want to tell her that to her face, she’d never forgive me.\n\nI wish things were simple like they were in elementary school.  :( :( :(\n\n<3,\n\nKate",
  "emotion": "anger",
  "emotion_distribution": {
    "sadness": 3.39,
    "joy": 1.99,
    "love": 0.09,
    "anger": 94.17,
    "fear": 0.31,
    "surprise": 0.05
  }
},
{
  "_id": {
    "$oid": "64a165e429fd8dca7845fc8c"
  },
  "email": "user1@example.com",
  "created_at": "2023-06-07",
  "content": "June 7, 2023\n\nDear Diary,\n\nToday was a tough day. Sarah and Jane barely spoke to each other, and I could feel the tension between them. It's hard to see my two friends not getting along. I tried talking to both of them separately, but they were both so stubborn. Sarah kept saying that Jane was being fake, and Jane felt like Sarah was overreacting. I wish they could just sit down and have an honest conversation to sort things out, but it seems like they're not ready for that yet.\n\nIn the meantime, I've been feeling caught in the middle. Whenever I hang out with one of them, the other seems distant or hurt. It's a difficult situation for me, and I'm not sure how to handle it. I don't want to choose sides, but I also want to support both of my friends. It's putting a strain on our friendship triangle, and it's taking a toll on me too.\n\nOn top of all that, schoolwork is piling up. I have that huge paper due for AP English, and I feel overwhelmed with all the research I need to do. I wish I could focus better, but the tension between Sarah and Jane is constantly on my mind. I hope things get better soon. I miss the carefree days when we were all just friends without any drama.\n\nI'll try to take some time for myself tonight, maybe read a book or watch a movie to take my mind off things. I need a break from all this emotional turmoil.\n\nGoodnight,\n\nKate",
  "emotion": "anger",
  "emotion_distribution": {
    "sadness": 0.12,
    "joy": 0.12,
    "love": 0.04,
    "anger": 98.41,
    "fear": 1.27,
    "surprise": 0.05
  }
},
{
  "_id": {
    "$oid": "64a165f7e159f5e40c9b97b9"
  },
  "email": "user1@example.com",
  "created_at": "2023-06-10",
  "content": "June 10, 2023\n\nDear Diary,\n\nIt's been a few days since I last wrote, and things are still complicated. Sarah and Jane are still not talking much, and it feels like our group dynamic has completely shifted. I miss the laughter and fun we used to have. It's strange how a small misunderstanding can have such a big impact on our friendship.\n\nI've been trying my best to maintain a neutral position and be there for both of them, but it's exhausting. I wish they could see that they're both at fault in some way and just forgive each other. I've suggested sitting down and talking it out, but they both seem resistant to the idea. It's frustrating because I want to help them, but they need to be willing to work things out too.\n\nIn the midst of all this, my schoolwork is suffering. I barely have any motivation to study or complete my assignments. My mind is preoccupied with thoughts of Sarah and Jane. I need to find a way to focus on my own goals and not let their issues consume me. It's easier said than done, though.\n\nI'm considering talking to a trusted teacher or counselor about the situation. Maybe they can offer some guidance or advice on how to navigate these friendship challenges. It's important for me to prioritize my mental well-being and find a way to manage the stress.\n\nI hope that one day we can all look back at this and laugh, realizing how silly it was to let a misunderstanding come between us. But until then, I'll continue to do my best and hope for a resolution.\n\nSending tired but hopeful vibes,\n\nKate",
  "emotion": "joy",
  "emotion_distribution": {
    "sadness": 1.58,
    "joy": 51.95,
    "love": 1.13,
    "anger": 15.02,
    "fear": 30.07,
    "surprise": 0.25
  }
},
{
  "_id": {
    "$oid": "64a1660c11581f4397e1349c"
  },
  "email": "user1@example.com",
  "created_at": "2023-06-12",
  "content": "June 12, 2023\n\nDear Diary,\n\nIt's been a rollercoaster of emotions lately. Sarah and Jane finally had a conversation today, and it didn't go as smoothly as I had hoped. They both had pent-up frustrations and ended up arguing. It was heartbreaking to witness.\n\nI tried my best to mediate and encourage them to listen to each other, but they were too caught up in their own feelings to truly hear one another. It feels like our friendship is hanging by a thread, and I'm not sure how much longer it can hold on.\n\nIn the midst of all this, I received my grade for the geometry quiz I was worried about. It wasn't as terrible as I had anticipated, but it still wasn't great. My dad was disappointed, and I can't blame him. I need to step up my game and prioritize my studies, even with all the drama going on.\n\nTo add to my plate, there's a cultural event at my school next week, and I've been asked to participate. It's an excellent opportunity to showcase my talents and get involved, but I'm hesitant given the current state of my friendships. I don't want my participation to cause more tension or make anyone feel left out.\n\nI'm feeling drained, physically and emotionally. I need some time to recharge and take care of myself. Maybe a day spent in nature or doing something I love will help clear my mind and bring some clarity to this chaotic situation.\n\nHoping for a breakthrough,\n\nKate",
  "emotion": "sadness",
  "emotion_distribution": {
    "sadness": 99.9,
    "joy": 0.03,
    "love": 0.02,
    "anger": 0.03,
    "fear": 0.02,
    "surprise": 0.01
  }
},
{
  "_id": {
    "$oid": "64a1662a3b8ffbb0d2818f6a"
  },
  "email": "user1@example.com",
  "created_at": "2023-06-15",
  "content": "June 15, 2023\n\nDear Diary,\n\nI'm writing to you with a mix of relief and sadness today. Sarah and Jane finally had a heart-to-heart conversation yesterday, and while it was emotional, it brought some closure to their misunderstandings. They realized that they both missed the friendship we had before and acknowledged their own contributions to the tension. It was a big step forward, and I'm grateful for it.\n\nHowever, our dynamics have shifted. While Sarah and Jane have made amends, it feels like something has changed between us. The easy camaraderie we once had seems distant now. We're still friends, but the trust has been shaken, and it will take time to rebuild.\n\nOn a positive note, I decided to participate in the cultural event at school. It was a much-needed distraction from the drama and allowed me to showcase my talents. I performed a traditional dance with a group of classmates, and the audience's applause brought a sense of accomplishment. It reminded me of the joy that comes from pursuing my passions.\n\nIn terms of schoolwork, I've been gradually getting back on track. The AP English paper is coming along, although it's been challenging to focus with everything going on. I'm determined to put in the effort and deliver a strong piece of work.\n\nLooking ahead, I hope our friendship can heal and find its footing again. It won't be easy, but with open communication and a commitment to understanding, I believe we can rebuild the bond we once had. For now, I'll take it one day at a time and remain hopeful for a brighter future.\n\nWith a mixture of hope and trepidation,\n\nKate",
  "emotion": "sadness",
  "emotion_distribution": {
    "sadness": 63.69,
    "joy": 31.27,
    "love": 0.93,
    "anger": 3.75,
    "fear": 0.29,
    "surprise": 0.08
  }
},
{
  "_id": {
    "$oid": "64a1663d76ad2415e1723c49"
  },
  "email": "user1@example.com",
  "created_at": "2023-06-18",
  "content": "June 18, 2023\n\nDear Diary,\n\nTime seems to be healing the wounds of our friendship, albeit slowly. Sarah, Jane, and I have been making small strides in rebuilding our bond. We've been spending more time together, laughing, and reminiscing about the good times we shared. It's comforting to see glimpses of our old friendship resurfacing.\n\nWe've also started to address the issues that caused the strain in the first place. We've had honest conversations about our expectations, communication styles, and how we can better support each other. It hasn't been easy, as it requires vulnerability and introspection, but it's an essential step towards rebuilding trust.\n\nIn the midst of all this, my AP English paper deadline is approaching rapidly. I've been dedicating a significant amount of time to researching, writing, and editing. It's been challenging to find the right balance between my academic responsibilities and nurturing our friendship. However, I'm determined to prioritize both and give my best in all areas of my life.\n\nApart from academics and friendships, my parents continue to encourage me to explore extracurricular activities. I've been contemplating joining a dance club at school. Not only would it allow me to pursue my passion, but it would also provide an opportunity to meet new people and broaden my horizons. I'm nervous about taking on more commitments, but I believe it could be a positive step towards personal growth.\n\nOverall, things are gradually falling back into place. The wounds are healing, and our friendship is becoming stronger through the process. It's a testament to the resilience of our bond and the power of open communication. I'm hopeful that with time, patience, and continued effort, we'll regain the closeness we once had.\n\nWishing for continued progress,\n\nKate",
  "emotion": "joy",
  "emotion_distribution": {
    "sadness": 0.07,
    "joy": 99.4,
    "love": 0.41,
    "anger": 0.06,
    "fear": 0.04,
    "surprise": 0.02
  }
},
{
  "_id": {
    "$oid": "64a16654bcce697bf0118527"
  },
  "email": "user1@example.com",
  "created_at": "2023-06-20",
  "content": "June 20, 2023\n\nDear Diary,\n\nI'm overjoyed to share some positive news with you today. Our friendship has made significant progress, and it feels like we've turned a corner. Sarah, Jane, and I spent the day together, just like old times, and it was filled with laughter and genuine happiness.\n\nWe've grown closer by understanding each other's perspectives and working through our differences. It's become clear that our friendship is built on a solid foundation of trust and shared experiences. The challenges we faced have only made us stronger individually and as a group.\n\nIn school, my hard work paid off, and I received positive feedback on my AP English paper. It was a relief to see my efforts recognized, and it motivated me to continue striving for excellence in my studies. I've also started attending the dance club, and it has been an amazing outlet for creativity and self-expression. I've met new friends who share my passion, and it's been a refreshing change of pace.\n\nAs the days go by, the weight on my shoulders feels lighter. The tensions and uncertainties that once plagued our friendship have been replaced with a renewed sense of camaraderie and support. It's as if we've rediscovered the beauty of our friendship and are determined to cherish it.\n\nLooking forward, I'm excited about the upcoming summer break. We've made plans to spend quality time together, exploring new places, and creating unforgettable memories. It's a reminder that true friendships can weather storms and come out even stronger on the other side.\n\nWith a grateful heart,\n\nKate",
  "emotion": "joy",
  "emotion_distribution": {
    "sadness": 0.3,
    "joy": 99.31,
    "love": 0.29,
    "anger": 0.05,
    "fear": 0.02,
    "surprise": 0.04
  }
},
{
  "_id": {
    "$oid": "64a16c551b7d4b002396c722"
  },
  "email": "user1@example.com",
  "created_at": "2023-07-01",
  "content": "July 1, 2023\n\nDear Diary,\n\nToday marks the end of an eventful chapter in my life. The summer break has begun, and I find myself reflecting on the ups and downs of the past month. It's been a rollercoaster ride of emotions, challenges, and growth, but I'm grateful for the lessons I've learned and the stronger bonds that have emerged.\n\nOver the past few days, Sarah, Jane, and I have spent even more time together, making the most of our newfound harmony. We've embarked on adventures, explored new hobbies, and simply enjoyed each other's company. It's incredible how much laughter and joy can fill our lives when we let go of misunderstandings and embrace the love and support of true friendship.\n\nAs we look ahead to the summer break, we've made plans for travel and exploration. It's a chance to create lasting memories and strengthen our connection even further. We're all eager to make the most of this time and seize the opportunities that come our way.\n\nIn terms of my personal growth, I've realized the importance of effective communication, empathy, and being present for my friends. The challenges we faced forced me to confront my own shortcomings and reevaluate my actions. I've become more mindful of the impact my words and actions have on others, and I'm committed to being a better friend going forward.\n\nAcademically, I'm proud of the progress I've made. My dedication to my studies has paid off, and I've achieved improved grades and a greater sense of confidence in my abilities. I'll continue to strive for excellence, knowing that education is a valuable tool for my future endeavors.\n\nAs I conclude this diary entry, I'm filled with gratitude for the resilience and endurance of true friendship. Our journey wasn't easy, but it taught me the importance of patience, forgiveness, and the power of second chances. I'm excited about the adventures and memories that lie ahead this summer and beyond.\n\nWith a heart full of joy and anticipation,\n\nKate",
  "emotion": "joy",
  "emotion_distribution": {
    "sadness": 0.07,
    "joy": 99.54,
    "love": 0.28,
    "anger": 0.06,
    "fear": 0.02,
    "surprise": 0.03
  }
}]